src/main/resources/xml/AustralianPostCode/getAustralianLocationByPostCode/getAustralianLocationByPostCode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetAustralianLocationByPostCode>
         <!--Optional:-->
         <web:PostCode>NSW</web:PostCode>
      </web:GetAustralianLocationByPostCode>
   </soapenv:Body>
</soapenv:Envelope>