src/main/resources/xml/ausPostCodeSoap/getAustralianLocationByPostCode/getAustralianLocationByPostCode.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetAustralianLocationByPostCode>
         <!--Optional:-->
         <web:PostCode>NSW 1002</web:PostCode>
      </web:GetAustralianLocationByPostCode>
   </soapenv:Body>
</soapenv:Envelope>