src/main/resources/xml/AustralianPostCode/getAustralianPostCodeByLocation/getAustralianPostCodeByLocation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetAustralianPostCodeByLocation>
         <!--Optional:-->
         <web:Location>Ravenswood</web:Location>
      </web:GetAustralianPostCodeByLocation>
   </soapenv:Body>
</soapenv:Envelope>